### Pandas: merge con 3 dataframes

In [1]:
import pandas as pd

In [8]:
dfPedidos = pd.read_csv("../ficheros_curso/merge/Pedidos.txt", sep=';')
dfPedidos.head()

   idpedido cliente  idempleado  idempresa  importe       pais
0     10248   WILMK           5          3    32.38  Finlandia
1     10249   TOMSP           6          1    11.61   Alemania
2     10250   HANAR           4          2    65.83     Brasil
3     10251   VICTE           3          1    41.34    Francia
4     10252   SUPRD           4          2    51.30    Belgica

In [9]:
dfEmpresas = pd.read_csv("../ficheros_curso/merge/Empresas.txt", sep=";")
dfEmpresas.head()

   id           empresa
0   1    Speedy Express
1   2    United Package
2   3  Federal Shipping

In [10]:
dfEmpleados = pd.read_csv("../ficheros_curso/merge/Empleados.txt",sep=';')
dfEmpleados.head()

   id     nombre                     cargo
0   1    Davolio   Representante de ventas
1   2     Fuller  Vicepresidente comercial
2   3  Leverling   Representante de ventas
3   4    Peacock   Representante de ventas
4   5   Buchanan         Gerente de ventas

In [11]:
dfTotal = pd.merge(dfEmpleados, dfPedidos, left_on='id', right_on="idempleado")
dfTotal.head()

,id,nombre,cargo,idpedido,cliente,idempleado,idempresa,importe,pais
0,1,Davolio,Representante de ventas,10258,ERNSH,1,1,140.51,Austria
1,1,Davolio,Representante de ventas,10270,WARTH,1,1,136.54,Finlandia
2,1,Davolio,Representante de ventas,10275,MAGAA,1,1,26.93,Italia
3,1,Davolio,Representante de ventas,10285,QUICK,1,2,76.83,Alemania
4,1,Davolio,Representante de ventas,10292,TRADH,1,2,1.35,Brasil

In [12]:
dfTotal = dfTotal.merge(dfEmpresas, left_on="idempresa", right_on="id")
dfTotal.head()

,id_x,nombre,cargo,idpedido,cliente,idempleado,idempresa,importe,pais,id_y,empresa
0,1,Davolio,Representante de ventas,10258,ERNSH,1,1,140.51,Austria,1,Speedy Express
1,1,Davolio,Representante de ventas,10270,WARTH,1,1,136.54,Finlandia,1,Speedy Express
2,1,Davolio,Representante de ventas,10275,MAGAA,1,1,26.93,Italia,1,Speedy Express
3,1,Davolio,Representante de ventas,10351,ERNSH,1,1,162.33,Austria,1,Speedy Express
4,1,Davolio,Representante de ventas,10364,EASTC,1,1,71.97,Reino Unido,1,Speedy Express

In [14]:
dfTotal.rename(columns={"nombre":"empleado", "cargo":"puesto"}, inplace=True)
dfTotal.head()

,id_x,empleado,puesto,idpedido,cliente,idempleado,idempresa,importe,pais,id_y,empresa
0,1,Davolio,Representante de ventas,10258,ERNSH,1,1,140.51,Austria,1,Speedy Express
1,1,Davolio,Representante de ventas,10270,WARTH,1,1,136.54,Finlandia,1,Speedy Express
2,1,Davolio,Representante de ventas,10275,MAGAA,1,1,26.93,Italia,1,Speedy Express
3,1,Davolio,Representante de ventas,10351,ERNSH,1,1,162.33,Austria,1,Speedy Express
4,1,Davolio,Representante de ventas,10364,EASTC,1,1,71.97,Reino Unido,1,Speedy Express

In [15]:
dfTotal.drop(columns=["id_x", "idempleado","idempresa","id_y"], inplace=True)
dfTotal.head()

,empleado,puesto,idpedido,cliente,importe,pais,empresa
0,Davolio,Representante de ventas,10258,ERNSH,140.51,Austria,Speedy Express
1,Davolio,Representante de ventas,10270,WARTH,136.54,Finlandia,Speedy Express
2,Davolio,Representante de ventas,10275,MAGAA,26.93,Italia,Speedy Express
3,Davolio,Representante de ventas,10351,ERNSH,162.33,Austria,Speedy Express
4,Davolio,Representante de ventas,10364,EASTC,71.97,Reino Unido,Speedy Express

In [16]:
dfTotal = dfTotal[["idpedido","cliente","empleado","empresa","pais","importe"]]
dfTotal.head()

   idpedido cliente empleado         empresa         pais  importe
0     10258   ERNSH  Davolio  Speedy Express      Austria   140.51
1     10270   WARTH  Davolio  Speedy Express    Finlandia   136.54
2     10275   MAGAA  Davolio  Speedy Express       Italia    26.93
3     10351   ERNSH  Davolio  Speedy Express      Austria   162.33
4     10364   EASTC  Davolio  Speedy Express  Reino Unido    71.97

In [21]:
dfTotal2 = dfTotal[["cliente","empleado","empresa","pais"]].copy()
dfTotal2.sort_values(by=["pais","empresa","empleado","cliente"], inplace=True)
dfTotal2.head()

    cliente  empleado           empresa      pais
736   QUICK  Buchanan  Federal Shipping  Alemania
801   BLAUS  Callahan  Federal Shipping  Alemania
815   DRACD  Callahan  Federal Shipping  Alemania
790   QUICK  Callahan  Federal Shipping  Alemania
805   QUICK  Callahan  Federal Shipping  Alemania

In [22]:
dfTotal2.shape

(830, 4)